NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFM32PG23/EFM32PG23B210F64IM48.svd
        <register>
          <name>ST14_ARC</name>
          <description>No Description</description>
          <addressOffset>0x238</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FFFFF</resetMask>
          <fields>
            <field>
              <name>SCOMP</name>
              <description>Sensor compare value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMASK</name>
              <description>Sensor mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CURSTATE</name>
              <description>Current State </description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure transition action in normal mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No PRS output generated (if PRSCOUNT == 0), or do not count (if PRSCOUNT == 1).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS0</name>
                  <description>Pulse generated on LESENSE PRS output 0 (if PRSCOUNT == 0).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Count Up (if PRSCOUNT == 1).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS1</name>
                  <description>Pulse generated on LESENSE PRS output 1 (if PRSCOUNT == 0).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWN</name>
                  <description>Count Down (if PRSCOUNT == 1).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS01</name>
                  <description>Pulse generated on LESENSE PRS output 0 and 1 (if PRSCOUNT == 0).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS2</name>
                  <description>Pulse generated on LESENSE PRS output 2. (PRSCOUNT == 0 OR 1).</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS02</name>
                  <description>Pulse generated on LESENSE PRS output 0 and 2 (if PRSCOUNT == 0).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPANDPRS2</name>
                  <description>Count Up and Pulse generated on LESENSE PRS output 2 (if PRSCOUNT == 1).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS12</name>
                  <description>Pulse generated on LESENSE PRS output 1 and 2 (if PRSCOUNT == 0).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWNANDPRS2</name>
                  <description>Count Down and Pulse generated on LESENSE PRS output 2 (if PRSCOUNT == 1).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS012</name>
                  <description>Pulse generated on LESENSE PRS output 0, 1 and 2 (if PRSCOUNT == 0).</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next state index</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set interrupt flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST15_ARC</name>
          <description>No Description</description>
          <addressOffset>0x23C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FFFFF</resetMask>
          <fields>
            <field>
              <name>SCOMP</name>
              <description>Sensor compare value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMASK</name>
              <description>Sensor mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CURSTATE</name>
              <description>Current State </description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure transition action in normal mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No PRS output generated (if PRSCOUNT == 0), or do not count (if PRSCOUNT == 1).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS0</name>
                  <description>Pulse generated on LESENSE PRS output 0 (if PRSCOUNT == 0).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Count Up (if PRSCOUNT == 1).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS1</name>
                  <description>Pulse generated on LESENSE PRS output 1 (if PRSCOUNT == 0).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWN</name>
                  <description>Count Down (if PRSCOUNT == 1).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS01</name>
                  <description>Pulse generated on LESENSE PRS output 0 and 1 (if PRSCOUNT == 0).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS2</name>
                  <description>Pulse generated on LESENSE PRS output 2. (PRSCOUNT == 0 OR 1).</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS02</name>
                  <description>Pulse generated on LESENSE PRS output 0 and 2 (if PRSCOUNT == 0).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPANDPRS2</name>
                  <description>Count Up and Pulse generated on LESENSE PRS output 2 (if PRSCOUNT == 1).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS12</name>
                  <description>Pulse generated on LESENSE PRS output 1 and 2 (if PRSCOUNT == 0).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWNANDPRS2</name>
                  <description>Count Down and Pulse generated on LESENSE PRS output 2 (if PRSCOUNT == 1).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS012</name>
                  <description>Pulse generated on LESENSE PRS output 0, 1 and 2 (if PRSCOUNT == 0).</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next state index</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set interrupt flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST16_ARC</name>
          <description>No Description</description>
          <addressOffset>0x240</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FFFFF</resetMask>
          <fields>
            <field>
              <name>SCOMP</name>
              <description>Sensor compare value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMASK</name>
              <description>Sensor mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CURSTATE</name>
              <description>Current State </description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure transition action in normal mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No PRS output generated (if PRSCOUNT == 0), or do not count (if PRSCOUNT == 1).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS0</name>
                  <description>Pulse generated on LESENSE PRS output 0 (if PRSCOUNT == 0).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Count Up (if PRSCOUNT == 1).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS1</name>
                  <description>Pulse generated on LESENSE PRS output 1 (if PRSCOUNT == 0).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWN</name>
                  <description>Count Down (if PRSCOUNT == 1).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS01</name>
                  <description>Pulse generated on LESENSE PRS output 0 and 1 (if PRSCOUNT == 0).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS2</name>
                  <description>Pulse generated on LESENSE PRS output 2. (PRSCOUNT == 0 OR 1).</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS02</name>
                  <description>Pulse generated on LESENSE PRS output 0 and 2 (if PRSCOUNT == 0).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPANDPRS2</name>
                  <description>Count Up and Pulse generated on LESENSE PRS output 2 (if PRSCOUNT == 1).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS12</name>
                  <description>Pulse generated on LESENSE PRS output 1 and 2 (if PRSCOUNT == 0).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWNANDPRS2</name>
                  <description>Count Down and Pulse generated on LESENSE PRS output 2 (if PRSCOUNT == 1).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS012</name>
                  <description>Pulse generated on LESENSE PRS output 0, 1 and 2 (if PRSCOUNT == 0).</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next state index</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set interrupt flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST17_ARC</name>
          <description>No Description</description>
          <addressOffset>0x244</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FFFFF</resetMask>
          <fields>
            <field>
              <name>SCOMP</name>
              <description>Sensor compare value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMASK</name>
              <description>Sensor mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CURSTATE</name>
              <description>Current State </description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSACT</name>
              <description>Configure transition action in normal mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No PRS output generated (if PRSCOUNT == 0), or do not count (if PRSCOUNT == 1).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS0</name>
                  <description>Pulse generated on LESENSE PRS output 0 (if PRSCOUNT == 0).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Count Up (if PRSCOUNT == 1).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS1</name>
                  <description>Pulse generated on LESENSE PRS output 1 (if PRSCOUNT == 0).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWN</name>
                  <description>Count Down (if PRSCOUNT == 1).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS01</name>
                  <description>Pulse generated on LESENSE PRS output 0 and 1 (if PRSCOUNT == 0).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS2</name>
                  <description>Pulse generated on LESENSE PRS output 2. (PRSCOUNT == 0 OR 1).</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS02</name>
                  <description>Pulse generated on LESENSE PRS output 0 and 2 (if PRSCOUNT == 0).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPANDPRS2</name>
                  <description>Count Up and Pulse generated on LESENSE PRS output 2 (if PRSCOUNT == 1).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS12</name>
                  <description>Pulse generated on LESENSE PRS output 1 and 2 (if PRSCOUNT == 0).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWNANDPRS2</name>
                  <description>Count Down and Pulse generated on LESENSE PRS output 2 (if PRSCOUNT == 1).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS012</name>
                  <description>Pulse generated on LESENSE PRS output 0, 1 and 2 (if PRSCOUNT == 0).</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEXTSTATE</name>
              <description>Next state index</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETIF</name>
              <description>Set interrupt flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
